---
kind: other
id: AllMembers.T:Autodesk.Revit.Exceptions.DirectoryNotEmptyException
source: html/41624264-93f9-e0b9-5f10-ed6d21cee043.htm
---
# DirectoryNotEmptyException Members

Retrieves data needed to serialize the target object.